#+TITLE:XenHunt Config (telega)
#+AUTHOR: Evgeny Berlizov (XenHunt)
#+DESCRIPTION: XenHunt's config of telega
#+STARTUP: content
#+PROPERTY: header-args :tangle telega-package.el
* Содержание
:PROPERTIES:
:TOC:      :include all :depth 100 :force (nothing) :ignore (this) :local (nothing)
:END:
:CONTENTS:
- [[#введение][Введение]]
- [[#fast-loading][Fast-Loading]]
- [[#telegael][Telega.el]]
- [[#provide][Provide]]
:END:
* Введение
:PROPERTIES:
:CUSTOM_ID: введение
:END:

Эта часть конфига посвящена настройке =telega.el= - клиента =Telegram= для =Emacs=.

* Fast-Loading
:PROPERTIES:
:CUSTOM_ID: fast-loading
:END:

Быстрая загрузка модуля.

#+begin_src emacs-lisp
;; -*- lexical-binding: t;  no-byte-compile: t -*-
#+end_src

* Telega.el
:PROPERTIES:
:CUSTOM_ID: telegael
:END:
#+begin_src emacs-lisp
(use-package telega
  :defer t
  :commands (telega)
  :custom
  (telega-use-images t)
  (telega-emoji-use-image t)
  (telega-symbol-heavy-checkmark "✔✔")
  (telega-chat-send-message-on-ret 'if-at-the-end)
  (telega-emoji-font-family  "Noto Color Emoji")
  :config
  (let ((libs '(telega-dired-dwim telega-dashboard telega-mnz telega-transient)))
    (mapc (lambda (x) (require x)) libs))
  (telega-notifications-mode 1)
  (global-telega-mnz-mode 1))
#+end_src

#+RESULTS:
: [nil 26403 17277 313326 nil elpaca-process-queues nil nil 514000 nil]

* Provide
:PROPERTIES:
:CUSTOM_ID: provide
:END:
#+begin_src emacs-lisp
(provide 'telega-package)
#+end_src
